# GetFrameOfReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConicalSurface..::..GetFrameOfReference Method
ConicalSurface Class See Also
---
Returns frame of reference associated with this ConicalSurface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public Frame GetFrameOfReference()
```

Visual Basic
---
```text
Public Function GetFrameOfReference As Frame
```

Visual C++
---
```text
public:
Frame^ GetFrameOfReference()
```

# ### Return Value
Frame of reference associated with this ConicalSurface.
# Remarks
This is an equivalent of new Frame(Origin, XDir, YDir, Axis).
# See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace